{"data":{"posts":{"totalCount":35,"pageInfo":{"totalPages":3,"currentPage":2},"edges":[{"node":{"id":"31","title":"Clas Ohlson powerbank","subtitle":"Unboxingvideo","abstract":"Ingenting er så kjip som å gå tom for strøm på mobilen, kameraet eller nettbrettet når det passer minst. Jeg testet en powerbank fra Clas Ohlson og i denne videoen pakker jeg den ut. Litt forvirret med rekkefølgen?","bodytext":"<p>Siden vi ofte er på tur på steder hvor det ikke alltid er like lett å få ladet mobilen og nettbrett så snek det seg inn et behov for en nødlader. Dette er jo ikke noe nytt i seg selv. Men for min del har jeg hatt en del rimelige varianter fra Kina. Og ingen av dem holder noe av det de lover av kapasitet eller funksjonalitet. Nå overrasker ikke det meg heller.</p>\n<p>Så denne gangen gikk jeg for en koster langt mer og som hadde fått en over snittet god omtale fra Clas Ohlson. Den var i tillegg på tilbud.</p>\n<p>Så var det denne rekkefølgen da på hvordan jeg kan anbefale en powebank før jeg har pakket den opp. Vel, ingen lever i paradis for alltid. Ikke min powebank heller, for den ene USB-kontakten ble løs og sluttet å fungere. Men Clas Ohlson byttet powerbank på garantien uten å blunke. Dermed kan jeg fortsatt anbefale denne og på nytt pakke den opp (denne gangen foran kamera).</p>\n","thumbnail":"","image":"","externalUrl":"","created_at":1560773407954,"updated_at":1560773828799,"path":"/skriverier/clas-ohlson-powerbank","date":"2018-10-09 10:10:07","source":""}},{"node":{"id":"30","title":"Boya BY-MM1","subtitle":"Unboxingvideo","abstract":"Siden min Røde VideoMic GO ble forstyrret av wifi-signalet fra kameraet mitt og ga dårlig lyd så bestilte jeg meg en rimelig mikrofon fra AliExpress. Her har jeg en kort video hvor jeg forklarer bakgrunnen og pakker opp den nye mikrofonen.","bodytext":"<p>Lyden i videoen er dårlig. Mye av det kommer av at jeg i første halvdel ikke har noe mikrofon annet enn den innebygde i kameraet.</p>\n<p>Jeg burde undersøkt det før jeg bestilte min Røde VideoMic GO at den er følsom for forstyrrelser som wifi og bluetooth. I etterkant har jeg slitt veldig med dårlig lyd og uønskede artefakter i lyden pga forstyrrelsene. Som jeg nevner i videoen så har jeg prøvd ulike tilnærminger som å skru av wifi og bluetooth på kameraet, ulike lydkabler og til og med pakket inn kabel og deler av mikrofonen i aluminiumsfolie.</p>\n<p>Jeg har ikke funnet opp disse tingene selv, men lest og sett tips på nett. Ingen av dem fungerte for meg. Det er egentlig litt trist fordi mikrofonen er rimelig dyr og skal ha høy lydkvalitet. Men det ikke altså ikke veiene for meg.</p>\n<p>Derfor endte jeg opp med å bestille en rimelig mikrofon fra AliExpress som hadde fått god omtale. Dette er altså en Boya BY-MM1. Det jeg har rukket å teste så langt så har ikke denne problemer med at det er apparater med wifi eller bluetooth i nærheten.</p>\n","thumbnail":"","image":"","externalUrl":"","created_at":1560772529966,"updated_at":1560773531508,"path":"/skriverier/boya-by-m-m1","date":"2018-10-09 00:00:00","source":""}},{"node":{"id":"21","title":"La oss asfaltere Klukhagan","subtitle":"","abstract":"Jeg må vel ærlig innrømme at jeg er svært farget av mitt syn på at Hamar bør beholde flyplassen. Men la oss leke litt med tanken da at flyplassen blir historie, samfunnsnytten til flyplassen blir side satt og opp spretter det rekkehus og blokker med asfalterte veier og gangstier.","bodytext":"<p><img src=\"https://cdn-images-1.medium.com/max/11232/1*bvudElj5E3wAPumW3s71Hg.jpeg\" alt=\"Det er økonomisk og effektivt å bo tett. Men la oss ikke glemme de naturlige grønne lungene som allerede eksisterer.\"><em>Det er økonomisk og effektivt å bo tett. Men la oss ikke glemme de naturlige grønne lungene som allerede eksisterer.</em></p>\n<p>Jeg vet ikke hvor mange boliger det er plass til på flystripa eller i området rundt. Nå vet vi at gjenvinningstasjonen som ligger vegg-i-vegg med flyplassen snart blir flyttet. Hele Klukhagan kan jevnes ned og bli til boliger. Folk vil jo gjerne bo litt tett. Det ser vi i områdene på Voll- og Lundjordet.</p>\n<p>Skal jeg prøve å oppsummere med en ufagelig gjetting så vi snakker fort om noen tusen mennesker som kan bosette seg på flyplassen, gjenvinningen og Klukhagan.</p>\n<p>Men glemmer vi at disse menneskene skal ha det bra etter at vi har erstattet et yndet rekreasjonsområdet med asfalt og boliger?</p>\n<p><strong>Klukhagan bør bestå slik det gjør i dag!</strong></p>\n<p>Hvis det blir mer utbygging av boligområder på flyplassen, gjenvinningstasjonen og kanskje til og med i området fra Stafsberg og nedover mot Furnesvegen i tillegg til allerede etablerte Voll- og Lundjordet så vil Klukhagan bli Hamars mest sentrale flekk hvor mennesker kan komme seg av asfaltert vei. <a href=\"https://www.h-a.no/debatt/klukhagan-er-velferd\">Klukhagan er velferd</a>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/12000/1*v74kBktQ9GS7qUVijtnpPQ.jpeg\" alt=\"\"></p>\n<p>Jeg tror veldig mange glemmer at folk gjerne vil ha gangavstand til «sitt» område. For de som allerede bor på Smeby, Solvang, Volljordet, Mælumsløkka og til og med Ajer så er Klukhagan viktig. Langt viktigere enn rekkehus og blokker.</p>\n<p>Det er langt billigere og effektivt å beholde de naturlige grønne lungene som eksisterer i dag enn å prøve å skape nye når byen vokser.</p>\n<p>Vi ønsker selvsagt at Hamar skal vokse. Vi liker å kalle oss for hovedstaden i Innlandet. Samtidig så må vi ikke glemme å ta vare på de små og gode grønne flekkene vi har igjen i vår iver etter å fremstå som fristende for innflyttere.</p>\n<p>Fristen for å si din mening om planlagt nytt boligområdet i Klukhagan er 3. november 2018. Mer informasjon kan du finne på Hamar kommune sine nettsider <a href=\"https://www.hamar.kommune.no/article44780-1282.html\">https://www.hamar.kommune.no/article44780-1282.html</a></p>\n","thumbnail":"","image":"","externalUrl":"","created_at":1559733143484,"updated_at":1559741228286,"path":"/skriverier/la-oss-asfaltere-klukhagan","date":"2018-10-04 00:00:00","source":"https://medium.com/@helgejohnsen/la-oss-asfaltere-klukhagan-43adf6575ad3"}},{"node":{"id":"20","title":"Kidsa trenger ikke lære koding","subtitle":"","abstract":"","bodytext":"<p>Gi barna dramakurs og musikktimer før robotene begynner å danse</p>\n<blockquote>\n<p>Kidsa trenger ikke lære koding. Gi barna dramakurs og musikktimer før robotene gjør dem overflødige. Det haster.</p>\n</blockquote>\n<p>Dette skriver Nina Andersen-Borud i <a href=\"https://www.dn.no/kommentar/utdannelse/roboter/kultur/innlegg-kidsa-trenger-ikke-lare-koding/2-1-416411\">et innlegg i Dagens Næringsliv</a>.</p>\n<p>Når jeg var barn fikk jeg høre det samme. I år 2000 vil roboter styre verden, vi ville ha flyvende biler og middagen vil bestå av en pille ikke helt ulik <a href=\"http://charlieandthechocolatefactoryfilm.wikia.com/wiki/Three_Course_Dinner_Chewing_Gum\">tyggegummien til Willy Wonka</a> og alle vil være uten arbeid. Den eneste jeg visste om på 90-tallet som faktisk trodde på <a href=\"http://www.arngren.net/moller.html\">flyvende biler i 2000 det var Frithjof Arngren</a>. Samtidig så hadde jeg et håp om at han visste noe alle vi andre ikke visste om.</p>\n<p>Men jo nærmere vi kom lanseringen av endret verdensbilde, flyvende biler, roboter og arbeidsledighet jo større ble frykten for <a href=\"https://no.wikipedia.org/wiki/%C3%85r_2000-problemet\">Y2k</a>. Alt fokus ble flyttet over til at alle datamaskiner skulle slutte å virke i samme øyeblikk vi klirret i glassene og klokken slo 00:00 natt til 1. januar 2000.</p>\n<p>Vi glemte robotene, de flyvende bilene og Willy Wonka sin tyggegummi. På NRK hadde de livesending fra ulike steder i landet. De kunne fastslå at ingenting hadde endret seg og at det var lys i <a href=\"https://no.wikipedia.org/wiki/Keplerstjernen\">Keplerstjernen av Vebjørn Sand</a> utenfor Gardermoen.</p>\n<p>Hopper vi enda noen år tilbake, til samme år jeg ble født, hadde The Buggle en kjempehit med sangen <a href=\"https://www.youtube.com/watch?v=W8r-tXRLazs\">Video Killed The Radio Star</a>. Sangen ble skrevet to år tidligere men var fortsatt aktuell og nådde hitlistene verden rundt. For når VHS nå var på vei til å bli allemannseie så var det mange som fryktet fremtiden til radioen.</p>\n<p>Nesten 40 år senere så kan vi trygt si at vi lytter mer enn noen gang. Spesielt om vi slår sammen alle verdens radiokanaler, lydbøker og podcaster. Ingenting av dette hadde jeg fått om ingen før meg kunne kodet de linjene med kode. Den koden som gjør det mulig for at jeg kan høre på radio fra aller verdens hjørner eller høre på <a href=\"https://www.p4.no/programmer/misjonen/\">P4 Misjonen</a> når det passer meg best.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/9200/1*jCkaBCKG9rXTYcwzgSgG3Q.jpeg\" alt=\"Dagens digitale teknologi gir oss muligheten til å lytte mye mer enn tidligere\"><em>Dagens digitale teknologi gir oss muligheten til å lytte mye mer enn tidligere</em></p>\n<p>Før jeg fortsetter så ønsker jeg å hoppe noen år tilbake i tid. Y2k er igjen et aktuelt tema på NRK Dagsrevyen. Den nye mobiltelefonen til min mor kan ikke sende SMS. Den eneste i husstanden med et snev av digital kompetanse er meg.</p>\n<p>Den gangen var det jo slik at man måtte igjennom en rekke innstillinger for å stille inn mobiltelefonene til å kunne både sende og ta imot SMS. Det var ikke som i dag hvor man kan skru på mobiltelefonen så virker alt med en gang.</p>\n<p>15 år senere så er det ingen barn som kan å stille inn en mobiltelefon så den kan ta imot og sende SMS. Dette tar vi alle for gitt at skal fungere av seg selv. Og det gjør det. Takket være noen smarte hoder som med digital kompetanse har gjort det enkelt for oss selv.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/12000/1*JeWk_LWvE1YiD0HWnrYfbw.jpeg\" alt=\"Barn håndterer og lærer ny teknologi raskt\"><em>Barn håndterer og lærer ny teknologi raskt</em></p>\n<p>Det barna kan nå er å scrolle, klype, zoome, sveipe og trykke. De unge som i dag skal lage neste generasjon sveiper til både høyre og venstre i søken etter en make. Fingrene farer over nettbrettet i en hastighet som får meg til å undre om min generasjon var den siste generasjonen uten et snev av Supermann sine gener i seg.</p>\n<p>Det er likevel en ting jeg biter meg merke til blant de unge. For selv om de er eksperter på å bruke et nettbrett og datamaskiner så har de ingen forståelse av mekanismen bak. Hvis noe går galt kan de ikke fikse det. De kan heller ikke skape noe. For de kan kun å være forbrukere.</p>\n<p>De aller fleste barn i dag har en digital forståelse lik det min mor i 1999 hadde. De forventer at noe skal fungere, hvis ikke må de ha hjelp.</p>\n<p>Jeg liker ikke helt navnet Kodeklubb. Det kunne like gjerne hete Digital Kompetanse-klubb. Det svinger ikke så godt av det navnet, så vi beholder Kodeklubb. Vi utnytter barnas ferdigheter i bruken av nettbrett og datamaskiner og lærer dem å forstå den grunnleggende mekanismen bak.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*BoUO8-qrLRp-ptNejVohDA.jpeg\" alt=\"\"></p>\n<p>For mange barn er møtet med kodeklubb eller koding i skolen et møte hvor de lærer og forstår en rekke ting som skolebøkene ikke kan gi dem. Digital kompetanse vil være viktig i fremtiden.</p>\n<p>På samme måte som at VHS aldri tok livet av radioen så vil ikke koding ta livet av kunst og kultur.</p>\n","thumbnail":"","image":"https://res.cloudinary.com/sjsd/image/upload/c_scale,q_60,w_896/ihvtnb93dtjs30dk7bsc","externalUrl":"","created_at":1559733034525,"updated_at":1559741220125,"path":"/skriverier/kidsa-trenger-ikke-laere-koding","date":"2018-09-26 00:00:00","source":"https://medium.com/@helgejohnsen/kidsa-trenger-ikke-l%C3%A6re-koding-5c1a9fea1f53"}},{"node":{"id":"19","title":"Bare en frontend-utvikler","subtitle":"","abstract":"Har du hørt det før? At de som jobber med frontend er en lavere kaste enn de som titulere seg som fullstack-utvikler, APP-utvikler eller [sett-inn-buzzword]-utvikler.","bodytext":"<ul>\n<li>Å ja, du er bare en frontend-utvikler</li>\n<li>Jeg er bare en frontend-utvikler</li>\n</ul>\n<p>Jeg kan sitere en tidligere kollega som i fult alvor påsto at de som sitter med frontend alltid er så normale og sikter mye lavere, mens de som er spillprogrammerere/programvareutviklere sikter mye høyere og er mye mer unike.</p>\n<p>Jeg er normalt en rimelig sindig mann så den samtalen fortsatte en kort stund inne i hodet mitt mens øynene antageligvis himlet himmelhøyt. Den påstanden ble høvelig sablet ned med ukvemsord som ville fått en full sjømann fra Nordnorge til å rødme og viste min tidligere kollegas manglende innsikt i hvilken grener bedriften mestret.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7296/1*xKjRc1GSsnKLs7oqIUjKOw.jpeg\" alt=\"Man kan like gjerne være en nøytral person ikledd dongeribukse og collegegenser og likevel være en dyktig utvikler. Egenskaper som empati, evnen til å kommunisere er viktige egenskaper for en utvikler. Foto: Loe Moshkovska https://www.pexels.com/photo/woman-wearing-black-and-orange-leather-jacket-756914/\"><em>Man kan like gjerne være en nøytral person ikledd dongeribukse og collegegenser og likevel være en dyktig utvikler. Egenskaper som empati, evnen til å kommunisere er viktige egenskaper for en utvikler. Foto: Loe Moshkovska <a href=\"https://www.pexels.com/photo/woman-wearing-black-and-orange-leather-jacket-756914/\">https://www.pexels.com/photo/woman-wearing-black-and-orange-leather-jacket-756914/</a></em></p>\n<p>Bakgrunnen til dette innlegget er ikke min tidligere kollegas påstand om at frontend-utviklere er av den enkle sorten. Men innlegget <a href=\"https://zellwk.com/blog/good-frontend-developer/\">What makes a good frontend developer?</a></p>\n<blockquote>\n<p>More people think that frontend developers are people with great JavaScript skills. But there’s more to frontend development than JavaScript. And as professional frontend developers, we need to understand what our jobs are.</p>\n</blockquote>\n<p>Resten kan du lese selv. For i det innlegget diskuteres det en del egenskaper en god frontend-utvikler bør ha. Mange av dem gjelder ikke bare frontend-utviklere men alle som programmerer.</p>\n<p>Summen av innlegget og min egen oppfattelse av en god utvikler er ikke ene og alene programeringsspråkene men evnen til å forstå hva oppgaven går ut på, hva som skal løses og hvem som skal ta det man lager i bruk.</p>\n<p>Les også mitt innlegg om <a href=\"https://medium.com/@helgejohnsen/universell-utforming-p%C3%A5-nett-c7607f6c5524\">universell utforming på nett</a>, et felt jeg selv brenner for og mener en frontend-utvikler bør ha kontroll på.</p>\n","thumbnail":"https://res.cloudinary.com/sjsd/image/upload/c_lfill,h_405,q_60,w_720/fz3cfzzqzckesq4dzv51","image":"","externalUrl":"","created_at":1559732795453,"updated_at":1565009227379,"path":"/skriverier/bare-en-frontend-utvikler","date":"2018-09-11 00:00:00","source":"https://medium.com/@helgejohnsen/bare-en-frontend-utvikler-a01b049d8284"}},{"node":{"id":"18","title":"Livet satt på prøve uten internett og fjernsyn — takk Canal Digital","subtitle":"","abstract":"Kan man gå på veggen av kjedsomhet? JA!","bodytext":"<p>Tidligere i vinter gikk jeg rimelig hardt ut mot avhengigheten av sosiale medier og smarttelefoner. Et slags lite oppgjør med meg selv hvor jeg innså at jeg, som mange andre, er totalt avhengig av sosiale medier og smarttelefon.</p>\n<blockquote>\n<h1>Jeg dreper ikke kjedsomheten ved å sjekke mobiltelefonen hvert eneste ledige sekund. Jeg tilfredsstiller en trang til å sjekke mobiltelefonen. Jeg er avhengig av den.</h1>\n</blockquote>\n<p>Sitat: <a href=\"https://medium.com/@helgejohnsen/kunne-jeg-klart-meg-med-en-dumtelefon-b5d2d9676a99\">https://medium.com/@helgejohnsen/kunne-jeg-klart-meg-med-en-dumtelefon-b5d2d9676a99</a></p>\n<p>De siste dagene har Canal Digital satt mitt vante liv på prøve. Ikke bare mitt liv, men hele familien sin moderne livsstil ble satt på en prøve. En feil hos Canal Digital førte til at vi måtte leve mange dager uten tilgang til fjernsyn og internett.</p>\n<p>Det første du tenker nå er at jeg syter voldsomt. Det har du nok rett i.</p>\n<p>Det er jo ikke slik at vi har levd uten internett eller fjernsyn tidligere. Vi har f.eks. vært flere dager i strekk på hytta uten tilgang til vår daglige dose underholdning, innlagt vann og strøm. Men da har vi vært forberedt på det. Psykisk forberedt på et liv uten den daglige dosen med skapt underholdning. Vi har med vilje oppsøkt dette livet.</p>\n<p>Det er smertefullt når plasteret brått blir revet av uten at man er forberedt. Svært smertefullt. I mange dager har hele familien gått rundt med en uro i kroppen. Det er som om noe mangler. I en svært stor grad.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2160/1*fj_sqAxq_lL4_r-Ai3rKQQ.png\" alt=\"Klokken 15. Klokken 21. Tiden gikk men feilen ble aldri rettet innen den Canal Digital lovet. Til slutt fjernet de meldingen og skrev at det ikke var noe feil i området. Bedre å lyve helt enn å bryte lovnader gang på gang.\"><em>Klokken 15. Klokken 21. Tiden gikk men feilen ble aldri rettet innen den Canal Digital lovet. Til slutt fjernet de meldingen og skrev at det ikke var noe feil i området. Bedre å lyve helt enn å bryte lovnader gang på gang.</em></p>\n<p>En faktor som fikk det til å bli litt mer smertefullt var lovnaden fra Canal Digital om at de skulle fikse problemet. Man gikk jevnlig og sjekket om signalene var tilbake. Før man innså at det hele var en løgn.</p>\n<p>Jeg tror det er på tide å endre svaret på spørsmålet som jeg stilte meg selv i mitt forrige innlegg: <a href=\"https://medium.com/@helgejohnsen/kunne-jeg-klart-meg-med-en-dumtelefon-b5d2d9676a99\">Kunne jeg klart meg med en dumtelefon?</a> JA!</p>\n","thumbnail":"","image":"https://res.cloudinary.com/sjsd/image/upload/c_scale,q_60,w_896/n0blunidivqjldll3mtz","externalUrl":"","created_at":1559732701905,"updated_at":1559741206751,"path":"/skriverier/livet-satt-pa-prove-uten-internett-og-fjernsyn-takk-canal-digital","date":"2018-06-25 00:00:00","source":"https://medium.com/@helgejohnsen/livet-satt-p%C3%A5-pr%C3%B8ve-uten-internett-og-fjernsyn-takk-canal-digital-dfe078620dc3"}},{"node":{"id":"17","title":"Universell utforming på nett","subtitle":"","abstract":"Jeg ble spurt om jeg kunne holde et innlegg på et frokostmøte om universell utforming. Det er jo fryktelig populært med slike frokoster. Som kjent så er frokost dagens viktigste måltid. Sies det da. Til tross for utallige forsøk på å overtale meg så takket jeg høflig nei. Flere ganger.","bodytext":"<p>Jeg er langt bedre til å skrive enn å stå foran en forsamling sultne og fremmede mennesker. Jeg er jo ikke spesielt god til å skrive heller. Så det sier jo en hel del om hvordan det går når jeg skal snakke til en forsamling.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/3840/1*kGqMs1YROwsuP4HpQ0smaA.jpeg\" alt=\"Om det er 6 eller 100 fremmede så utgjør det ikke noe forskjell på min frykt for å snakke til eller med mennesker jeg ikke kjenner. Til tross for at jeg brenner for en rekke saker her i livet så er jeg ikke noe foredragsholder. Jeg er en programmerer som brenner for universell utforming. Foto: Pixabay https://pixabay.com/no/publikum-mengden-folk-personer-828584/\"><em>Om det er 6 eller 100 fremmede så utgjør det ikke noe forskjell på min frykt for å snakke til eller med mennesker jeg ikke kjenner. Til tross for at jeg brenner for en rekke saker her i livet så er jeg ikke noe foredragsholder. Jeg er en programmerer som brenner for universell utforming. Foto: Pixabay <a href=\"https://pixabay.com/no/publikum-mengden-folk-personer-828584/\">https://pixabay.com/no/publikum-mengden-folk-personer-828584/</a></em></p>\n<p>Det betyr ikke at jeg ikke brenne for eller kan noe om universell utforming. Tvert imot. Mitt ståsted er at det er <strong>for lite fokus</strong> på universell utforming både i den fysiske verden og i den «virtuelle verden».</p>\n<p>Det gjelder alt ifra hvordan gatekryss er laget for fotgjengere, billettautomater, dørhåndtak, utforming og plassering av knapper i en heis osv.</p>\n<p><strong>Advarsel:</strong> Ikke tenk for mye på slike ting. For du kan gå rett i fella og begynne å irritere deg over de små detaljene i hverdagen. Det siste dine medpassasjerer i en trang og klaustrofobisk heis ønsker er en hissig person som er så opptatt av at knappene er feil utformet. <strong>Men det er viktig at du er klar over og observant på slike detaljer.</strong></p>\n<p>Når jeg skriver «virtuell verden» så tenker jeg først og fremst på internettet.</p>\n<p>De aller fleste av oss kan lese denne teksten med våre egne øyne uten hjelpemidler. Noen må kanskje ty til et par briller. Men verden består av så mange andre også. Så hvorfor skulle vi utelukke de fra det vi til daglig tar for gitt?</p>\n<blockquote>\n<p>Det finnes ingen oversikt over hvor mange som er blinde eller svaksynte i Norge, men det antas at 2–3 prosent av befolkningen har så stort synstap at de ikke kan oppfatte store deler av den informasjonen andre tar som en selvfølge. Blir samfunnets informasjon tilrettelagt for synshemmede, vil man gjøre den mer tilgjengelig for alle. Kilde: «<a href=\"https://goo.gl/uwBY5F\">Internett for alle</a>» — Norges Blindeforbund</p>\n</blockquote>\n<p><img src=\"https://cdn-images-1.medium.com/max/6706/1*cCdSJ0mOqjQkm-soL5hlIw.jpeg\" alt=\"Med de rette hjelpemidlene så kan ting bli tydelig. Men det er jo en forutsetning at hjelpemiddelet kan forstå det den skal se. Ved å kode en nettside i henhold til standarder så kan hjelpemidlene forstå innholdet og presentere det korrekt til bruker.\"><em>Med de rette hjelpemidlene så kan ting bli tydelig. Men det er jo en forutsetning at hjelpemiddelet kan forstå det den skal se. Ved å kode en nettside i henhold til standarder så kan hjelpemidlene forstå innholdet og presentere det korrekt til bruker.</em></p>\n<p>På internett kan man i dag kjøpe varer og tjenester, man kan se og lytte til både video og lyd, skaffe seg venner, avtale et stevnemøte, blogge, tweete, delta i samfunnsdebatten eller få undervisning.</p>\n<p>Alle kommuner, fylkeskommuner og andre offentlige instanser legger ut viktig informasjon til innbyggere og andre som er berørt.</p>\n<p>Det er rett og slett ikke riktig at man da skal utelukke den delen av befolkningen som har en eller annen nedsatt funksjon. Enten de er svaksynte, fargeblinde, blinde, døve eller har en motorisk nedsatt funksjon som kanskje gjør at de ikke kan bruke en vanlig datamus eller tastatur.</p>\n<p>Vi har til og med <a href=\"https://uu.difi.no/krav-og-regelverk/kva-seier-forskrifta\">forskrifter</a> som sier noe om det. Selv om <a href=\"https://www.nrk.no/sognogfjordane/partia-sine-heimesider-far-stryk-_-verst-ut-kjem-krf-1.13560669\">de som har bestemt det selv ikke følger sine egne bestemmelser</a>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2024/1*s6tTKgaq_TIFEpP4KxX2Ow.png\" alt=\"«Alle partia på Stortinget får strykkarakterar i Direktoratet for forvaltning og IKT (Difi) si statusmåling på politiske parti 2017. Dei lukkar seg for 20 prosent av befolkninga, meiner Difi.» Skjermbilde fra NRK: https://www.nrk.no/sognogfjordane/partia-sine-heimesider-far-stryk-_-verst-ut-kjem-krf-1.13560669\"><em>«Alle partia på Stortinget får strykkarakterar i Direktoratet for forvaltning og IKT (Difi) si statusmåling på politiske parti 2017. Dei lukkar seg for 20 prosent av befolkninga, meiner Difi.» Skjermbilde fra NRK: <a href=\"https://www.nrk.no/sognogfjordane/partia-sine-heimesider-far-stryk-_-verst-ut-kjem-krf-1.13560669\">https://www.nrk.no/sognogfjordane/partia-sine-heimesider-far-stryk-_-verst-ut-kjem-krf-1.13560669</a></em></p>\n<p>Difi hevder altså at så mye som 20% av Norges befolkning ble holdt utenfor ved at nettsidene til de politiske partiene i forkant av valget i 2017 ikke tok hensyn til universell utforming.</p>\n<p>Hvis du sitter i et organ som skal informere eller belære noen så er det viktig at du får ut budskapet ditt til fleste mulig mennesker. Hvis du er bedriftseier og skal på et eller annet nivå selge noe så bør alle kunne ta kontakt eller få bestilt det du selger.</p>\n<p><strong>Du vil nå ut til alle!</strong></p>\n<blockquote>\n<p>Universelt utformede nettsider vil si at disse kan betjenes og leses av flest mulig mennesker, uavhengig av deres valg av hjelpemidler og teknologier.\n«<a href=\"https://goo.gl/uwBY5F\">Internett for alle</a>» — Norges Blindeforbund</p>\n</blockquote>\n<p>Vi kan ta et par eksempler som alle kan relatere seg til: nettbutikk. Ja for hvem av oss har ikke handlet noe på internett? Enten det er konsertbillett, klær, datautstyr eller annet …</p>\n<h3>Booke flybillett</h3>\n<p>Når jeg som kan se skal bestille flybillett så velger jeg destinasjonene A og B, samt dato og velger så tiden når flyet letter (eller lander) som passer meg best. I tillegg er det ting som pris med å avgjøre hvilken billett jeg velger å kjøpe. Kjapt og enkelt.</p>\n<p>Slik er det ikke for alle. Er man helt blind så skal man holde tunga rett i munnen for å få til det samme som meg. Hvordan velge korrekt dato i kalenderen, hvordan se opplistingen over avganger og priser? Man er avhengig av at koden som viser nettstedet også kan presentere alle valg og evt. valg som endrer seg ut ifra valg man tar underveis (som prisen) også blir presentert korrekt.</p>\n<p>Man er rett og slett avhengig av at hjelpemiddel får presentert innholdet på nettsiden korrekt.</p>\n<h3>Kjøpe mat</h3>\n<p>Markedet for dagligvarehandel på nett høres ut som en luksus for de fleste av oss. Få varer levert på døra. Enten det er poser med dagligvarer vi kan sette i kjøleskapet eller ferdig tilmålte matkasser. Hva med ferske boller til frokost? Bare det å gå til butikken kan være en utfordring for en stor kundegruppe. Prøv med lukkede øyne neste gang du svinger innom den lokale dagligvarebutikken.</p>\n<p>Ved å kode netthandelen for dagligvarer korrekt så øker man faktisk kundegrunnlaget. Hvis jeg skulle miste synet mitt i dag så ville jeg bestilt alt av varer på internett. Hvis det er mulig da.</p>\n<h3>Ikke alle er blinde</h3>\n<p>Men man trenger ikke være blind heller. Det kan være mennesker som har vanskeligheter med å bruke datamus til å flytte på en musepeker på en skjerm. Kanskje de er avhengig av tastatur eller andre hjelpemidler.</p>\n<p>Har du prøvd å kun bruke tastatur for å navigere på et nettsted? Det er ikke alltid like lett. Egentlig veldig vanskelig hvis nettstedet ikke følger de gjeldende standardene.</p>\n<p>Jeg skal ikke gå inn på hvordan man koder nettsider korrekt. Min henstilling er til alle eiere av nettsteder, prosjektledere, designere, programmerere og hele kjeden med mennesker som fra start til slutt er med i et prosjekt for et nettsted skal ta stilling til universell utforming. Vi må tørre og satse!</p>\n<h3>Noen gode kilder er:</h3>\n<p><strong>Norge Blindeforbund:</strong> <a href=\"https://www.blindeforbundet.no/universell-utforming/nettsider-ikt-og-automater\">https://www.blindeforbundet.no/universell-utforming/nettsider-ikt-og-automater</a></p>\n<p><strong>Difi:</strong> <a href=\"https://www.difi.no/fagomrader-og-tjenester/digitalisering-og-samordning/kvalitet-pa-nett\">https://www.difi.no/fagomrader-og-tjenester/digitalisering-og-samordning/kvalitet-pa-nett</a></p>\n<p><strong>WCAG:</strong> <a href=\"https://www.w3.org/WAI/intro/wcag\">https://www.w3.org/WAI/intro/wcag</a></p>\n","thumbnail":"https://res.cloudinary.com/sjsd/image/upload/c_lfill,h_405,q_60,w_720/joqsyu17jkegoef2thlm","image":"","externalUrl":"","created_at":1559732509897,"updated_at":1568704730952,"path":"/skriverier/universell-utforming-pa-nett","date":"2018-06-01 00:00:00","source":"https://medium.com/@helgejohnsen/universell-utforming-p%C3%A5-nett-c7607f6c5524"}},{"node":{"id":"16","title":"Kjære posten - vi to må snakke sammen","subtitle":"","abstract":"","bodytext":"<p>Kjære Posten!</p>\n<p>Mitt forhold til deg er ambivalent. Jeg er avhengig av dine tjenester. Ja, jeg innrømmer det. Du er min dealer. Du leverer en tjeneste jeg trenger. Vi to har et elsk-hat-forhold.</p>\n<p>Jeg forstår du i disse dager er under sterkt press. Jeg ser jo at samfunnet er i endring. Det er lenge siden postordrekataloger fant sin vei til min postkasse. Alt er liksom på internett nå. Selv du leverer post via internett.</p>\n<p>Før så kom den hyggelige postmannen og leverte brev i min postkasse. Frankerte konvolutter som du tok betalt for å levere. Som dekke lønnen til den hyggelige postmannen.</p>\n<p>Med internett så dukker det opp andre typer post. Regningene leveres elektronisk. Selv julekort og andre hilsninger tikker nå inn elektronisk.</p>\n<p>Men pakkene jeg handler på internett leveres i «postkassen». La du merke til anførselstegnene? Les litt videre så gir det mening.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*5YVtJw7MQPjjL6eRZLTvwg.jpeg\" alt=\"Typisk postkasse på en mandag. Uken begynner med kampanjer fra ulike varehus i nærheten.\"><em>Typisk postkasse på en mandag. Uken begynner med kampanjer fra ulike varehus i nærheten.</em></p>\n<p>For det er jo slik det er blitt: du får betalt for å fylle postkassen min med reklame. Jeg har i mange år stått imot presset til å sette på et klistremerke som sier nei til reklame. Dette presset er blitt betydelig svakere.</p>\n<p>For du husker dette gode forholdet vi har? Jeg er med på å sørge for at du får betalt. Du sørger for å levere post til meg.</p>\n<p>Men nå har dine pressede økonomiske rammer tatt over det gode forholdet vårt. Det er ikke lenger jeg som er kunden din. Jeg er produktet ditt som du selger.</p>\n<p>For når du klarer å prioritere å fylle postkassen min med uadressert reklame, før du legger i adressert post, på en slik måte at jeg må hente min egen adressert post på postkontoret, da feiler du.</p>\n<p>Var det utydelig? Skal jeg si det med rene ord? Postmannen fyller postkassen med reklame slik at det ikke er plass til brev og pakker. Så tar postmannen med seg brev og pakkene mine til nærmeste post i butikk slik at jeg må hente den der.</p>\n<p>Da kan vi stryke over elsk i vårt elsk-hat-forhold.</p>\n<p>For ikke bare er jeg produktet du selger. Sakte men sikkert har du gjort meg fra et perfekt produkt til et dårlig produkt.</p>\n<p>Nå venter jeg på et klistremerke som jeg skal sette på postkassen min som forteller postmannen at jeg ikke ønsker reklame. Ironisk nok må jeg vel til min nærmeste <em>post i butikk</em> for å hente konvolutten.</p>\n<h3>Hvordan reservere seg mot reklame</h3>\n<blockquote>\n<p>Forbrukere som ikke ønsker å motta uadressert reklame eller gratisaviser kan merke postkassen og døra. Du velger selv om du vil benytte standardiserte “nei takk”-klistremerker eller merker du har laget selv.\nOm du vil reservere deg mot adressert reklame, gjøres det i <a href=\"https://w2.brreg.no/reservasjon/\">Brønnøysundregisteret</a>. De næringsdrivende plikter å sjekke registeret før de sender ut adressert markedsføring i posten til forbrukere.</p>\n</blockquote>\n<p>Kilde: Forbrukertilsynet <a href=\"https://www.forbrukertilsynet.no/lei-uonsket-reklame\">https://www.forbrukertilsynet.no/lei-uonsket-reklame</a></p>\n<p>Naturvernforbundet har også gratis klistremerker. Bestill de her <a href=\"https://naturvernforbundet.no/reserver-deg-mot-uadressert-reklame/category3687.html\">https://naturvernforbundet.no/reserver-deg-mot-uadressert-reklame/category3687.html</a></p>\n","thumbnail":"","image":"https://res.cloudinary.com/sjsd/image/upload/c_scale,q_60,w_896/nfw1frl83zhcpjtmdf5a","externalUrl":"","created_at":1559732320809,"updated_at":1559741189471,"path":"/skriverier/kjaere-posten-vi-to-ma-snakke-sammen","date":"2018-05-31 00:00:00","source":"https://medium.com/@helgejohnsen/kj%C3%A6re-posten-vi-to-m%C3%A5-snakke-sammen-955143989b64"}},{"node":{"id":"15","title":"Nå kommer de å tar arbeidet vårt, disse robotene!","subtitle":"Vi har fått oss robotstøvsuger","abstract":"Robotene kommer til å ta arbeidsplassene våre! Ja, du har sikkert lest eller hørt den påstanden før? Hvis du er riktig gammel nok, eller fulgte med i historietimen, så husker du sikkert at dampmaskinen gjorde sitt inntog i form av jernbane, skipstrafikk og industrien. Siden da har ingen vært i arbeid.","bodytext":"<p>I disse dager er vi nordmenn mest redd for tre ting. At roboter og utlendinger skal ta arbeidsplassene våre. Den tredje blir da at utenlandske roboter skal ta arbeidsplassene våre. Selv evner jeg ikke å se trusselen. Ikke for den første, den andre eller tredje.</p>\n<p>Jeg er nok litt mer hjemmekjær enn som så og tenker mest på mitt eget vel. Jeg bruker mye tid på å irritere meg over ting som er kjedelig. Det kan innebære daglige gjøremål som å tømme oppvaskmaskinen, henge opp klær eller støvsuge.</p>\n<p>Støvsuge ja! Det er nettopp sistnevnte som har fått meg til å skrive dette innlegget. For enn så lenge finnes det ikke noe roboter som henger opp eller parer sokkene mine. Ei heller tømmer oppvaskmaskinen eller tømme søpla. Men støvsuge derimot, der har vi fått oss hjelp.</p>\n<h2>Nå kommer de</h2>\n<p>Tidlig på 2000-tallet dukket de første selvgående støvsugene opp. De feide ikke markedet unna. Det gjør de ikke den dag i dag heller. Men produsentene selger nok til at de ikke helt har gitt opp håpet om å støvsuge lommebøkene til oss naive forbrukere.</p>\n<p>I løpet av de rundt 15 årene som har gått siden de første støvsugerrobotene kom på markedet så har de blitt betydelig bedre.</p>\n<h2>Pris</h2>\n<p>Et raskt søk på internett viser at man kan få robotstøvsugere fra rundt 500,- og tett opp til 10 høvdinger (10 000 kroner der altså). Man trenger ikke høyere utdannelse for å forstå at det er stor forskjell på evnen til robotstøvsugere i hver sin ende av prisskalaen.</p>\n<p>De mest spennende, og i mine øyne de man får mest igjen for pengene, finner man litt under midt på. Altså der hovedtyngden av robotstøvsugerne ligger i pris. Et sted mellom 2500–5000.</p>\n<p>Om jeg ikke har en robot som kan fikse alle de huslige arbeidsoppgavene så var jeg fast bestemt på å få feid over gulvet med litt automatikk med i bildet. Så undersøkelser ble tatt. Dvs. søking etter tester av modeller som befinner seg på det norske markedet.</p>\n<p>For det hjelper ikke at noen av de beste kan man få for en rimelig penge i utlandet når det kommer på frakt, moms og tollgebyrer. Da kan man heller legge de 10 høvdingene på bordet og kjøpe en i Norge.</p>\n<h2>Kriterier (mine egne)</h2>\n<p>Det er lett å bli blendet av hva alt en robotstøvsuger til 10-høvdinger kan gjøre. Men siden lommeboka allerede var støvsugd så måtte jeg forholde meg til litt mer edruelig nivå. Så jeg satte opp noen kriterier:</p>\n<ul>\n<li>økonomi (min egen)</li>\n<li>tepper</li>\n<li>sofa</li>\n<li>wifi</li>\n<li>batteritid</li>\n<li>ladetid</li>\n<li>tidsstyring</li>\n</ul>\n<p><strong>Økonomi:</strong> mest mulig for pengene og så billig som mulig. <strong>Tepper:</strong> vi har ikke tepper så det er ingen krav om at den må kunne håndtere overgang til tepper eller at levningene til Max Mekker ligger under stuebordet. <strong>Sofa:</strong> vi har en sofa med lav “bakkeklaring”. Kommer støvsugeren seg under der? <strong>Wifi</strong>: kjekt å ha men ikke nødvendig. <strong>Batteritid</strong>: hvis den går tilfeldig rundt så bør den ha lang kjøretid for å være sikker på å nå de fleste steder <strong>Ladetid:</strong> kan den ta to runder over gulvet mens vi er på arbeid i ukedagene? <strong>Tidsstyring:</strong> kan vi få den til å støvsuge på gitte tidspunkt, f.eks. hver dag mens vi er på jobb?</p>\n<h2>Hils på Dorte</h2>\n<p>Dette er Dorte. Vårt valg i øvre siktet av de rimeligste robotstøvsugere på markedet (i skrivende stund). Hun takler ikke tepper og ei heller dørterskler. Men sveiper over gulvet under vår lave sofa og jobber iherdig opp i mot 2 timer før hun må lades.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2580/1*MYEd70YlQecOcyivR304kA.jpeg\" alt=\"Blant de laveste og sniker seg under sofaen\"><em>Blant de laveste og sniker seg under sofaen</em></p>\n<p>Dorte sitt stamtavlenavn er Ecovac Deebot Slim 2.</p>\n<p>Nå får jeg ikke betalt for å skrive om Dorte. Så jeg skal prøve å skjule min begeistring over å ha fått veldig god hjelp til støvsugingen i huset.</p>\n<p>Dorte har to koster foran som samler inn støv, kakesmuler, lego m.m. før hun kjører over og suger det inn i en beholder. Bak på rumpa sitter det en mikrofiberklut som tar opp det børstene og støvsugeren ikke får med seg.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/3000/1*cenn3AVgyzO8HNutgtsonQ.jpeg\" alt=\"Børster samler støv inn mot åpningen som suger det opp. Den blå mikrofiberkluten samler opp resten.\"><em>Børster samler støv inn mot åpningen som suger det opp. Den blå mikrofiberkluten samler opp resten.</em></p>\n<p>Dorte jobber effektivt. Hun er ikke den skarpeste kniven i skuffen. Men har et enormt pågangsmot og er snill mot møbelbein. Pga sin lave høyde er hun heller ikke spesielt glad i kabler og ledninger. Ved et par tilfeller har hun kilt seg fast under sofaen pga at hun har kjørt oppå noe.</p>\n<h2>Fordeler og ulemper</h2>\n<p>Dorte trenger en litt TLC. Mikrofiberkluten beviser at å støvsuge og vaske ukentlig ikke holder. Hun (som veldig mange andre) takler ikke helt innerst i hjørnene. Men så lenge hun tar alt annet så blir det på sikt mindre i hjørne som vi selv kan ta.</p>\n<p>Hun kan styres via medfølgende fjernkontroll, via APP-en til mobiltelefonen og man kan sette opp tidsstyringer med ulike oppsett avhengig av dager i uka etc.</p>\n<p>Hun er rimelig flink til å finne tilbake til ladestasjonen og er alltid klar til lading når neste økt starter. Hun støyer litt og får derfor jobbe i fred på dagtid når huset stort sett er tomt.</p>\n<p>Er robotstøvsuger erstatter ikke at man må støvsuge manuelt. Men den letter betraktelig på og hjelper akkurat så mye mye til at hun er verdt de 2200,- hun kostet.</p>\n","thumbnail":"","image":"https://res.cloudinary.com/sjsd/image/upload/c_scale,q_60,w_896/z3e6ccfysijwm0qxxcvc","externalUrl":"","created_at":1559732156276,"updated_at":1559741183350,"path":"/skriverier/na-kommer-de-a-tar-arbeidet-vart-disse-robotene","date":"2018-05-11 00:00:00","source":"https://medium.com/@helgejohnsen/n%C3%A5-kommer-de-%C3%A5-tar-arbeidet-v%C3%A5rt-disse-robotene-a2ade1e0360d"}},{"node":{"id":"14","title":"Ny puter til AKG K141","subtitle":"","abstract":"AKG K141–over 22 år gamle. Litt slitt i kantene, støvete etter å ha vært lagret i boden i mange år. Men like gode og kan fortsatt den dag i dag konkurrere med de fleste moderne hodetelefoner. Ikke rar jeg ikke kan kaste disse.","bodytext":"<p>Dette er et unødvendig langt innlegg uten stort fotavtrykk på miljøet. Men bakgrunnen for innlegget lager et minimalt større fotavtrykk og moralen bak et desto større.</p>\n<h2>TL;DR</h2>\n<p>Jeg kjøpte nye puter til hodetelefonene mine fremfor å kjøpe nye hodetelefoner.</p>\n<h2>Bakgrunnen</h2>\n<p>En gang midt på 90-tallet var jeg fast bestemt på at min fremtid innebar å være lydteknikker. Det ble et annet karrièrevalg. Jeg skal ikke gå nærmere inn på det nå.</p>\n<p>I denne prosessen klarte jeg å overtale mine foreldre til å kjøpe et par hodetelefoner av veldig god kvalitet til min bursdag. Jeg hadde sett meg ut AKG K141. Så vi reiste til nærmeste musikkbutikk (ikke platebutikk) og som med respekt for seg selv hadde AKG K141. Reisen gikk til Gjøvik Musikk.</p>\n<p>En gang på begynnelsen av 2000-tallet var hodetelefonene fortsatt med meg. Men putene begynte å slippe det falske skinnet i små flak. Disse små sorte jævlene hadde den egenskapen at de fant et nytt sted å feste seg til. Spesielt på hud. Nærmere bestemt på ørene. Der ble de. Uansett hvor mye man gnidde og skrubbet. De måtte slites av.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*ZD6nkYb7vX2Zzk8mjpKJPQ.jpeg\" alt=\"Gamle puter begynner å slå sprekker\"><em>Gamle puter begynner å slå sprekker</em></p>\n<p>Det er litt ubeleilig å ha små sorte prikker på ørene. Så hodetelefonene ble lagt til sides og ikke brukt noe mer.</p>\n<h2>Frem fra glemselen</h2>\n<p>Oppigjennom årene har disse hodetelefonene blitt med på det ene flyttelasset etter det andre. Ubrukt. Men jeg har ikke hatt hjerte til å kaste dem heller.</p>\n<p>For noen uker siden fant jeg dem nederst i en eske. Jeg prøvde de igjen og jammen viser deg seg at lyden fortsatt er knallgod.</p>\n<p>På eBay fant jeg reserveputer. Det som på begynnelsen av 2000-tallet ikke var et marked er i 2018 et mye større et: reservedeler.</p>\n<p>AKG K141 er egentlig limt sammen og man kan ikke bytte putene på dem. Ihvertfall ikke uten makt. Så tidligere forsøk og tidligere år så har jeg ikke funnet reservedeler til dem.</p>\n<p>Jeg var til og med i kontakt med importøren av AKG i 2002. De hadde ikke noe løsning for meg. Men som nevnt: forskjellen på tidlig 2000-tallet og 2018 er at i dag ønsker folk å reparere fremfor å kjøpe nytt.</p>\n<h2>Bytte til nye puter fra eBay</h2>\n<p>Så på eBay fantes det nye puter som passer til mine K141. Det man trenger i tillegg er lim for å feste de nye putene.</p>\n<h3>Steg 1 — putene</h3>\n<p>Putene kommer i par og med “filter” av skumgummi.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*ckXxBT-yez_WbpDsME3ARw.jpeg\" alt=\"2 stk puter og 2 stk filter (skumgummi)\"><em>2 stk puter og 2 stk filter (skumgummi)</em></p>\n<h3>Steg 2 — riv av</h3>\n<p>Putene er limt fast. Så man må med rå makt dra de av. Støvete etter at de gamle “filterene” hadde morknet og gikk i oppløsning ved den minste berørelse.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*EBH2qnEAKZ143_va1Yiaew.jpeg\" alt=\"Slik ser det ut uten puter\"><em>Slik ser det ut uten puter</em></p>\n<h3>Steg 3 — på med “filter”</h3>\n<p>Legg på filteret av skumgummi. Det er jo et eget spor for det.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*AzC6neg9T6Z74LuvUfchBQ.jpeg\" alt=\"\"></p>\n<h3>Steg 4 — lim</h3>\n<p>Litt superlim må til for å få festet de nye putene igjen.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*r2xk-vAQ4A4fkXVUEvu14g.jpeg\" alt=\"“Karlsons universalklister”\"><em>“Karlsons universalklister”</em></p>\n<h3>Steg 5 — ferdig</h3>\n<p>La limet tørke og vips så er hodetelefonene like gode som nye.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/7936/1*G-g_wZOrEOdzQMel83L73g.jpeg\" alt=\"Her er de nye putene ferdig montert\"><em>Her er de nye putene ferdig montert</em></p>\n","thumbnail":"","image":"https://res.cloudinary.com/sjsd/image/upload/c_scale,q_60,w_896/elbsytugl95l5qn7lbym","externalUrl":"","created_at":1559732015361,"updated_at":1559741177514,"path":"/skriverier/ny-puter-til-akg-k141","date":"2018-04-19 00:00:00","source":"https://medium.com/@helgejohnsen/ny-puter-til-akg-k141-344f79c1d9ca"}},{"node":{"id":"13","title":"Boostrap kan strippes","subtitle":"","abstract":"Et innlegg jeg skrev for bransjebloggen 3min.io om hvordan man via SASS kan ta i bruk deler av rammeverket Bootstrap.","bodytext":"<p>Målet for Kodeklubben Hamar i 2018 er å få med flere jenter.</p>\n<p>Det er dessverre slik at det ligger mekanismer i samfunnet som hindrer jenter i å lære seg nødvendig kunnskap for å bli digitale skapere. «<em>Jenter skal være forbrukere av digitale medier, ikke skapere av det</em>» er beskjeden vi sender ut til barn og unge.</p>\n<p>I den samme aldersgruppen (6–18 år) er det omtrent like mange gutter og jenter som driver med idrett, musikk og friluftsliv. Det er ingen grunn til at digital teknologi skal være noe annerledes. For når det gjelder å være digitale forbrukere er det svært liten forskjell mellom gutter og jenter!</p>\n<p>Dette ønsker vi i Kodeklubben Hamar å gjøre noe med. Ved å arrangere en egen kveld kun for jenter viser vi både de voksne og barna selv at det ikke er noe i veien for at jenter kan bli dyktige skapere.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/4096/1*-R4Ya6MA0F3JFjnPq3BoWg.jpeg\" alt=\"Foto: Kristine Jorskogen\"><em>Foto: Kristine Jorskogen</em></p>\n<p>En ting er sikkert: <strong>jenter kan å kode!</strong> Det beviste vi til gangs denne kvelden på Hamar Katedralskole. Både under og etter arrangementet meldte mange jenter seg på den ordinære kodeklubben som arrangeres seks kvelder utover våren.</p>\n<p>Vi ønsker å sprenge glasstaket og gi jentene like gode muligheter som guttene til å bli digitale skapere og innovatører.</p>\n<p>Følg Kodeklubben på Facebook for informasjon og oppdateringer <a href=\"https://www.facebook.com/kodeklubbenhamar/\">https://www.facebook.com/kodeklubbenhamar/</a></p>\n<p>Samme kveld fikk vi i Kodeklubben Hamar lov til å spe på sendeplanen til NRK med to ulike innslag og radio dagen etter.</p>\n<p>**Direktesending TV: Distriktsnyheter Østnytt 26.feb. 2018 kl. 18:50 <a href=\"https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP99022618/26-02-2018#t=4m59s\">**https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP99022618/26-02-2018#t=4m59s</a></p>\n<p><strong>Repotasje TV: Distriksnyheter Østnytt 26.feb. 2018 kl. 22:55</strong> <a href=\"https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP97022618/26-02-2018#t=2m44s\">https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP97022618/26-02-2018#t=2m44s</a></p>\n<p>**Repotasje radio: Distriktsprogram — Hedmark og Oppland 27. feb. 2018 <a href=\"https://radio.nrk.no/serie/distriktsprogram-hedmark-og-oppland/DKHE01004218/27-02-2018#t=1h51m56s\">**https://radio.nrk.no/serie/distriktsprogram-hedmark-og-oppland/DKHE01004218/27-02-2018#t=1h51m56s</a></p>\n","thumbnail":"","image":"","externalUrl":"https://3min.io/ta-i-bruk-kun-rutenettet-til-bootstrap-f70e37d71a7b","created_at":1559730466652,"updated_at":1559732399888,"path":"/skriverier/boostrap-kan-strippes","date":"2018-04-17 08:27:46","source":""}},{"node":{"id":"12","title":"Jenter kan å kode!","subtitle":"","abstract":"Mandag 26. februar holdt Kodeklubben Hamar en egen jentekveld hvor jenter i alderen 6 til 18 år var invitert til å få en smakebit på hva vi i Kodeklubben driver med. De fikk prøve seg på Lego Mindstorm og Micro:bit. Helt fritt for guttelus!","bodytext":"<p>Målet for Kodeklubben Hamar i 2018 er å få med flere jenter.</p>\n<p>Det er dessverre slik at det ligger mekanismer i samfunnet som hindrer jenter i å lære seg nødvendig kunnskap for å bli digitale skapere. «<em>Jenter skal være forbrukere av digitale medier, ikke skapere av det</em>» er beskjeden vi sender ut til barn og unge.</p>\n<p>I den samme aldersgruppen (6–18 år) er det omtrent like mange gutter og jenter som driver med idrett, musikk og friluftsliv. Det er ingen grunn til at digital teknologi skal være noe annerledes. For når det gjelder å være digitale forbrukere er det svært liten forskjell mellom gutter og jenter!</p>\n<p>Dette ønsker vi i Kodeklubben Hamar å gjøre noe med. Ved å arrangere en egen kveld kun for jenter viser vi både de voksne og barna selv at det ikke er noe i veien for at jenter kan bli dyktige skapere.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/4096/1*-R4Ya6MA0F3JFjnPq3BoWg.jpeg\" alt=\"Foto: Kristine Jorskogen\"><em>Foto: Kristine Jorskogen</em></p>\n<p>En ting er sikkert: <strong>jenter kan å kode!</strong> Det beviste vi til gangs denne kvelden på Hamar Katedralskole. Både under og etter arrangementet meldte mange jenter seg på den ordinære kodeklubben som arrangeres seks kvelder utover våren.</p>\n<p>Vi ønsker å sprenge glasstaket og gi jentene like gode muligheter som guttene til å bli digitale skapere og innovatører.</p>\n<p>Følg Kodeklubben på Facebook for informasjon og oppdateringer <a href=\"https://www.facebook.com/kodeklubbenhamar/\">https://www.facebook.com/kodeklubbenhamar/</a></p>\n<p>Samme kveld fikk vi i Kodeklubben Hamar lov til å spe på sendeplanen til NRK med to ulike innslag og radio dagen etter.</p>\n<p>**Direktesending TV: Distriktsnyheter Østnytt 26.feb. 2018 kl. 18:50 <a href=\"https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP99022618/26-02-2018#t=4m59s\">**https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP99022618/26-02-2018#t=4m59s</a></p>\n<p><strong>Repotasje TV: Distriksnyheter Østnytt 26.feb. 2018 kl. 22:55</strong> <a href=\"https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP97022618/26-02-2018#t=2m44s\">https://tv.nrk.no/serie/distriktsnyheter-oestnytt/DKOP97022618/26-02-2018#t=2m44s</a></p>\n<p>**Repotasje radio: Distriktsprogram — Hedmark og Oppland 27. feb. 2018 <a href=\"https://radio.nrk.no/serie/distriktsprogram-hedmark-og-oppland/DKHE01004218/27-02-2018#t=1h51m56s\">**https://radio.nrk.no/serie/distriktsprogram-hedmark-og-oppland/DKHE01004218/27-02-2018#t=1h51m56s</a></p>\n","thumbnail":"","image":"","externalUrl":"","created_at":1559730103177,"updated_at":1559740944873,"path":"/skriverier/jenter-kan-a-kode","date":"2018-02-27 00:00:00","source":"https://medium.com/@helgejohnsen/jenter-kan-%C3%A5-kode-200fee5f6149"}}]}},"context":{}}